# Yosys synthesis script for AEAD-only Ascon core

# read design 
read_verilog -sv ../core_rtl/ascon_core_aead.sv

# generic synthesis
synth -top ascon_core

# mapping to cmos_cells.lib
dfflibmap -liberty ../syn/cmos_cells.lib
abc -liberty ../syn/cmos_cells.lib
clean

# write synthesized design
write_verilog syn_aead.v

# print statistics
stat -liberty ../syn/cmos_cells.lib
